Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCoordinateSystemType
The types of coordinate system that can be used for numeric input.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCoordinateSystemType.Cartesian
Cartesian coordinates.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCoordinateSystemType.Polar
Polar coordinates.